Repository: Fenriz1349/MediStock
Catalog: MediStock/Resources/Localizable.xcstrings
Source language: fr
Languages: en

# addMedicine.cancelButton
source: Annuler
en: Cancel

# addMedicine.navigationTitle
source: Nouveau médicament
en: New Medicine

# addMedicine.saveButton
source: Créer
en: Create

# aisleList.filterField
source: Filtrer par rayon
en: Filter by aisle

# aisleList.noResults
source: Aucun rayon trouvé
en: No aisle found

# allMedicines.filterField
source: Filtrer par nom
en: Filter by name

# allMedicines.filterField.hint
source: Ne recherche que le début du nom
en: Matches the start of the name only

# allMedicines.noResults
source: Aucun médicament trouvé
en: No medicine found

# allMedicines.sortOption.name
source: Nom
en: Name

# allMedicines.sortOption.none
source: Aucun
en: None

# allMedicines.sortPicker
source: Trier par
en: Sort by

# auth.email.invalidFormat
source: Saisissez une adresse e-mail valide.
en: Enter a valid email address.

# auth.error.emailAlreadyInUse
source: Un compte existe déjà avec cette adresse e-mail.
en: An account already exists with this email address.

# auth.error.requiresRecentLogin
source: Déconnectez-vous puis reconnectez-vous avant de réessayer.
en: Please sign out and sign in again before retrying.

# auth.error.unknown
source: Une erreur est survenue. Réessayez.
en: Something went wrong. Please try again.

# auth.error.weakPassword
source: Ce mot de passe est trop faible.
en: This password is too weak.

# auth.error.wrongCredentials
source: E-mail ou mot de passe incorrect.
en: Incorrect email or password.

# auth.login.button
source: Se connecter
en: Login

# auth.password.invalidFormat
source: Le mot de passe ne respecte pas les critères ci-dessous.
en: Password doesn't meet the requirements below.

# auth.password.placeholder
source: Mot de passe
en: Password

# auth.password.rule.digit
source: Un chiffre
en: One digit

# auth.password.rule.lowercase
source: Une minuscule
en: One lowercase letter

# auth.password.rule.minLength
source: 8 caractères minimum
en: At least 8 characters

# auth.password.rule.specialCharacter
source: Un caractère spécial
en: One special character

# auth.password.rule.uppercase
source: Une majuscule
en: One uppercase letter

# auth.signUp.button
source: Créer un compte
en: Sign Up

# keyboard.closeButton
source: Fermer
en: Close

# keyboard.validateButton
source: Valider
en: Validate

# medicine.error.permissionDenied
source: Vous n'avez pas la permission de faire ça.
en: You don't have permission to do this.

# medicine.error.unknown
source: Une erreur est survenue. Réessayez.
en: Something went wrong. Please try again.

# medicineDetail.aisle.invalidFormat
source: Saisissez un code de rayon.
en: Enter an aisle code.

# medicineDetail.aisle.label
source: Rayon
en: Aisle

# medicineDetail.editButton
source: Modifier
en: Edit

# medicineDetail.history.details
source: Détails : %@
en: Details: %@

# medicineDetail.history.title
source: Historique
en: History

# medicineDetail.history.user
source: Utilisateur : %@
en: User: %@

# medicineDetail.name.capitalizationHint
source: Le nom sera automatiquement mis en majuscule
en: The name will be capitalized automatically

# medicineDetail.name.invalidFormat
source: Saisissez au moins 2 caractères.
en: Enter at least 2 characters.

# medicineDetail.name.label
source: Nom
en: Name

# medicineDetail.navigationTitle
source: Détails du médicament
en: Medicine Details

# medicineDetail.saveButton
source: Enregistrer
en: Save

# medicineDetail.stock.invalidFormat
source: Saisissez un stock de 0 ou plus.
en: Enter a stock of 0 or more.

# network.error.notConnected
source: Pas de connexion internet. Réessayez.
en: No internet connection. Please try again.

# network.error.serverUnreachable
source: Le serveur est injoignable. Réessayez dans un instant.
en: The server could not be reached. Please try again shortly.

# offline.message
source: Pas de connexion internet. Une connexion active est nécessaire pour se connecter.
en: No internet connection. Signing in requires an active connection.

# offline.retryButton
source: Réessayer
en: Retry

# tab.aisles.title
source: Rayons
en: Aisles

# tab.allMedicines.title
source: Tous les médicaments
en: All Medicines

# tab.user.title
source: Compte
en: Account

# user.deleteAccount.cancelButton
source: Annuler
en: Cancel

# user.deleteAccount.confirmButton
source: Supprimer
en: Delete

# user.deleteAccount.confirmMessage
source: Cette action est irréversible.
en: This action cannot be undone.

# user.deleteAccount.confirmTitle
source: Supprimer le compte ?
en: Delete Account?

# user.deleteAccountButton
source: Supprimer mon compte
en: Delete My Account

# user.logoutButton
source: Se déconnecter
en: Log Out
